
## :x: Apply Failed

[CI link](https://github.com/hayas1/tfgh/actions/runs/11890301556)



<pre><code>Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories[&#34;relentless&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;],
  on module/repository/files.tf line 12, in resource &#34;github_repository_file&#34; &#34;this&#34;:
  12: resource &#34;github_repository_file&#34; &#34;this&#34; {

::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["relentless"].github_repository.this: Refreshing state... [id=relentless]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["relentless"].github_branch_default.this: Refreshing state... [id=relentless]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:45]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:48]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:80]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:29]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:13]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"7ae6480d192739ca4c1575ce23db50620bad48f593c69cbc3f69768a0ef57bb2\"" -> "W/\"9c6370bd27637ac4f8ce4417690f51844bb98ffb10ed5d6c816d25cc523ec266\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4743623b287c36600e0e8514ca5b803c23be07870b828abe61ff7e0ed88787cc\"" -> "W/\"ad509717d0e6764f5b1b97454141d81f76350fa01462fb90f8a1c4e673054fc9\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"84c4677f03eba2b27fd8368499b97c929f32a83dccd343f5967f642238230ce0\"" -> "W/\"93c1e0653540c05cd13b533a8344e7d02df7bf8594921a950f2194246508e762\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"dd821f9b3f2b3fde7f2422bc6fa75ed6e268207530c77d7c2db5f408ad2c1b6f\"" -> "W/\"44208769e728f7eadaeff8ddaff7ffde3003887bce93236bed77b669a8c1566b\""
        id                          = "relentless"
        name                        = "relentless"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"4d5d0ec2ec9fbd78cb2fc89d16d2fd5d28bb559e563420f4cca8c57003300c5b\"" -> "W/\"12ebf751e084f8ecb0d5bf1943ae5ea1e1f2a82d79b6ebf49d2cf1906649a7ea\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"fd0b583862fcd9cbe0144c8d58d4f688f34091577b75041df288e587af16b9dc\"" -> "W/\"9585e10b07b60b6bd5b0f0f31fd38f077537930025a1e4fe922e8392031e5d5b\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repositories["relentless"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "relentless"
      + url         = (known after apply)
    }

  # module.repositories["relentless"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "relentless"
        name                        = "relentless"
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "relentless"
      + sha                             = (known after apply)
    }

  # module.repositories["relentless"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "relentless"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["relentless"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "relentless"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
module.repositories["relentless"].github_repository.this: Modifying... [id=relentless]
module.repositories["relentless"].github_repository.this: Modifications complete after 2s [id=relentless]
module.repositories["relentless"].github_issue_label.this["documentation"]: Creating...
module.repositories["relentless"].github_issue_label.this["feature"]: Creating...
module.repositories["relentless"].github_issue_label.this["bugfix"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/issue_template.md"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Creating...
module.repositories["relentless"].github_repository_ruleset.this: Creating...
module.repositories["relentless"].github_issue_label.this["refactor"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Creating...
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Creating...
module.repositories["relentless"].github_repository_ruleset.this: Creation complete after 7s [id=2653838]
module.repositories["relentless"].github_issue_label.this["deps"]: Creating...
module.repositories["relentless"].github_issue_label.this["documentation"]: Creation complete after 7s [id=relentless:documentation]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Creating...
module.repositories["relentless"].github_issue_label.this["feature"]: Creation complete after 7s [id=relentless:feature]
module.repositories["relentless"].github_issue_label.this["breaking"]: Creating...
module.repositories["relentless"].github_issue_label.this["bugfix"]: Creation complete after 7s [id=relentless:bugfix]
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_issue_label.this["refactor"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_repository_file.this["github/labeler.yml"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_issue_label.this["refactor"]: Creation complete after 12s [id=relentless:refactor]
module.repositories["relentless"].github_issue_label.this["deps"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_issue_label.this["breaking"]: Still creating... [10s elapsed]
module.repositories["relentless"].github_issue_label.this["deps"]: Creation complete after 11s [id=relentless:deps]
module.repositories["relentless"].github_issue_label.this["maintenance"]: Creation complete after 11s [id=relentless:maintenance]
module.repositories["relentless"].github_issue_label.this["breaking"]: Creation complete after 12s [id=relentless:breaking]
module.repositories["relentless"].github_repository_file.this["github/release.yml"]: Creation complete after 19s [id=relentless/.github/release.yml]

Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories["relentless"].github_repository_file.this["github/issue_template.md"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories["relentless"].github_repository_file.this["github/workflows/labeler.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories["relentless"].github_repository_file.this["github/labeler.yml"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {


Error: POST https://api.github.com/repos/hayas1/relentless/git/refs: 422 Reference already exists []

  with module.repositories["relentless"].github_repository_file.this["github/pull_request_template.md"],
  on module/repository/files.tf line 12, in resource "github_repository_file" "this":
  12: resource "github_repository_file" "this" {

::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":76,"Program":"tfcmt","SHA1":"25fe74502b8f75a7c9552fb8a31fd6e104ebf026","Vars":{},"WorkflowName":"Terraform apply on push"} -->